In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

In [2]:
titanic = sns.load_dataset('titanic')

In [3]:
#타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category1 열을 만드시오. category1 카테고리는 다음과 같이 정의됨
#1)20살이 넘으면 성별을 그대로 사용한다.
#2)20살 미만이면 성별에 관계없이 “child”라고 한다.

titanic['category1'] =titanic.apply(lambda r: r.sex if r.age >= 20 else "child", axis = 1)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male

In [4]:
#타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값이 되도록 titanic 데이터프레임을 고치시오.

titanic['age'].fillna(titanic['age'].mean(), inplace = True)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
886,0,2,male,27.000000,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19.000000,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,29.699118,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.000000,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32.000000,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male

In [27]:
titanic['age'] = titanic.age.fillna(titanic.age.mean()).astype(int)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
886,0,2,male,27,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,29,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male

In [6]:
#성별, 선실(class)별, 출발지(embark_town)별 생존율을 구하시오.
titanic.pivot_table('survived','sex')

        survived
sex
female  0.742038
male    0.188908

In [28]:
titanic[['sex','survived']].groupby(['sex']).mean()

        survived
sex
female  0.742038
male    0.188908

In [29]:
titanic.groupby(titanic.sex)['survived'].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [30]:
titanic.pivot_table('survived', 'class')

        survived
class
First   0.629630
Second  0.472826
Third   0.242363

In [31]:
titanic.pivot_table('survived', 'embark_town')

             survived
embark_town
Cherbourg    0.553571
Queenstown   0.389610
Southampton  0.336957

In [35]:
titanic.survived.groupby([titanic.sex, titanic.pclass]).mean()

sex     pclass
female  1         0.968085
        2         0.921053
        3         0.500000
male    1         0.368852
        2         0.157407
        3         0.135447
Name: survived, dtype: float64

In [34]:
titanic.pivot_table('survived', ['sex','class'])

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [37]:
#타이타닉호 승객을 ‘미성년자’, ‘청년’, ‘중년’, ‘장년’, ‘노년’ 나이 그룹으로 나누고, 각 그룹별 생존율을 구하시오.

bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
titanic['age_cat'] = pd.cut(titanic.age, bins, labels = labels)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1,age_cat
886,0,2,male,27,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male,청년
887,1,1,female,19,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child,미성년자
888,0,3,female,29,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child,청년
889,1,1,male,26,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male,청년
890,0,3,male,32,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male,중년

In [40]:
titanic.pivot_table('survived', 'age_cat')  #그룹별 생존율

         survived
age_cat
미성년자     0.421687
청년       0.333333
중년       0.426778
장년       0.350000
노년       0.250000

In [41]:
#qcut 명령으로 세 개의 나이 그룹을 만들고, 나이 그룹별 남녀 성비와 생존율을 구하시오
titanic['age_group'] = pd.qcut(titanic.age, 3, labels=["A1", "A2", "A3"])
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1,age_cat,age_group
886,0,2,male,27,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male,청년,A2
887,1,1,female,19,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child,미성년자,A1
888,0,3,female,29,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child,청년,A2
889,1,1,male,26,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male,청년,A2
890,0,3,male,32,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male,중년,A3

In [43]:
# gender: 남성이면 1, 여성이면 0
titanic['gender'] = titanic.apply(lambda r: 1 if r.sex == 'male' else 0, axis=1)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1,age_cat,age_group,gender
886,0,2,male,27,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male,청년,A2,1
887,1,1,female,19,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child,미성년자,A1,0
888,0,3,female,29,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child,청년,A2,0
889,1,1,male,26,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male,청년,A2,1
890,0,3,male,32,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male,중년,A3,1

In [45]:
titanic.pivot_table(['survived','gender'],'age_group')

             gender  survived
age_group
A1         0.594684  0.411960
A2         0.680921  0.335526
A3         0.667832  0.405594

In [ ]:
titanic[['age_group','survived','gender']].groupby(['age_group']).mean()

In [21]:
 mpg = sns.load_dataset('mpg')

In [22]:
mpg.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [23]:
#배기량(displacement) 대비 마력(horsepower) 열(hp_per_cc)을 추가하시오.
mpg['hp_per_cc'] = mpg.displacement / mpg.horsepower
mpg.tail()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name,hp_per_cc
393,27.0,4,140.0,86.0,2790,15.6,82,usa,ford mustang gl,1.627907
394,44.0,4,97.0,52.0,2130,24.6,82,europe,vw pickup,1.865385
395,32.0,4,135.0,84.0,2295,11.6,82,usa,dodge rampage,1.607143
396,28.0,4,120.0,79.0,2625,18.6,82,usa,ford ranger,1.518987
397,31.0,4,119.0,82.0,2720,19.4,82,usa,chevy s-10,1.451220

In [53]:
#name으로부터 manufacturer(제조사)와 모델을 추출하여 새로운 열 manufacturer와 model을 추가하고, name 열은 삭제하시오.
def get_mfcer(full_name):
    return full_name.split()[0]
def get_model(full_name):
    return ' '.join(full_name.split()[1:])

In [54]:
get_mfcer('ford torino'), get_model('ford torino')

('ford', 'torino')

In [55]:
get_mfcer('chrysler lebaron medallion'), get_model('chrysler lebaron medallion')

('chrysler', 'lebaron medallion')

In [56]:
mpg['manufacturer'] = mpg.name.apply(get_mfcer)
mpg['model'] = mpg.name.apply(get_model)
del mpg['name']
mpg.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,hp_per_cc,manufacturer,model
0,18.0,8,307.0,130.0,3504,12.0,70,usa,2.361538,chevrolet,chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,2.121212,buick,skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,2.120000,plymouth,satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,2.026667,amc,rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,2.157143,ford,torino

In [26]:
# 엔진의 실린더(cylinders) 갯수별 연비(mpg)의 평균을 구하시오.
mpg.mpg.groupby([mpg.cylinders]).mean()

cylinders
3    20.550000
4    29.286765
5    27.366667
6    19.985714
8    14.963107
Name: mpg, dtype: float64

In [50]:
# 생산지(origin)별 배기량 대비 마력(hp_per_cc)의 평균을 구하시오.
mpg[['origin','hp_per_cc']].groupby('origin').mean()

        hp_per_cc
origin
europe   1.405597
japan    1.304120
usa      2.048289

In [57]:
#모델이 5개 이상인 제조사에 대하여 연비(mpg)의 평균이 가장 좋은 제조사 Top 5를 구하시오.
mpg.manufacturer.value_counts()

ford             51
chevrolet        43
plymouth         31
dodge            28
amc              28
toyota           25
datsun           23
buick            17
pontiac          16
volkswagen       15
honda            13
mercury          11
oldsmobile       10
mazda            10
peugeot           8
fiat              8
audi              7
chrysler          6
vw                6
volvo             6
renault           5
opel              4
saab              4
subaru            4
chevy             3
bmw               2
maxda             2
cadillac          2
mercedes-benz     2
capri             1
chevroelt         1
vokswagen         1
triumph           1
mercedes          1
nissan            1
hi                1
toyouta           1
Name: manufacturer, dtype: int64

In [58]:
s = mpg.manufacturer.value_counts()
big = s[s >= 5].index.tolist()
print(big)

['ford', 'chevrolet', 'plymouth', 'dodge', 'amc', 'toyota', 'datsun', 'buick', 'pontiac', 'volkswagen', 'honda', 'mercury', 'oldsmobile', 'mazda', 'peugeot', 'fiat', 'audi', 'chrysler', 'vw', 'volvo', 'renault']

In [61]:
big_mpg.pivot_table('mpg','manufacturer').sort_values(by='mpg', ascending=False)[:5]

                    mpg
manufacturer
vw            39.016667
honda         33.761538
renault       32.880000
datsun        31.113043
mazda         30.860000